Repository: Richasy/Rodel.Agent
Catalog: src/Desktop/RodelAgent.UI/Resources/*/Resources.resw
Source language: en_us
Languages: zh_hans_cn

source: About this app
zh_hans_cn: 关于此应用

source: Access key
zh_hans_cn: 访问密钥

# AccessKeyDescription
source: Enter the API key from {0}
zh_hans_cn: 填入来自 {0} 的 API 密钥

# AccessKeyPlaceholder
source: {0} API key
zh_hans_cn: {0} API 密钥

source: AccessKey Secret
zh_hans_cn: 访问密文（AccessKey Secret）

source: Add agent
zh_hans_cn: 添加助理

source: Add preset
zh_hans_cn: 添加预设

source: Add size
zh_hans_cn: 添加尺寸

source: Add text
zh_hans_cn: 添加文本

source: Add token
zh_hans_cn: 添加标记

# AddYourCustomModel
source: Is the model you use not in the list? Then create one!
zh_hans_cn: 使用的模型不在列表中？那就创建一个吧！

source: Agents
zh_hans_cn: 助理

# AliAccessKeyDescription
source: Register and obtain the key in Alibaba Cloud
zh_hans_cn: 在阿里云中注册并获取密钥

# AliSecretDescription
source: Register and obtain the secret in Alibaba Cloud
zh_hans_cn: 在阿里云中注册并获取 Secret

# AliTranslate
source: Alibaba Cloud Translate
zh_hans_cn: 阿里云翻译

source: API Key
zh_hans_cn: API 密钥（API Key）

source: API version
zh_hans_cn: API 版本

source: App ID
zh_hans_cn: 应用 ID

# AppIdDescription
source: Enter the registered application identifier
zh_hans_cn: 输入注册的应用标识符

source: App log
zh_hans_cn: 应用日志

# AppLogDescription
source: Configuration items related to application logs
zh_hans_cn: 应用日志相关的配置项

# AppName
source: Rodel Agent
zh_hans_cn: 小幻助理

# AppSearchPlaceholder
source: Search for what you want
zh_hans_cn: 找找你想要的

# AppTheme
source: Application theme
zh_hans_cn: 应用程序主题

# AppThemeDescription
source: Select the application theme to display
zh_hans_cn: 选择要显示的应用主题

source: Assistant
zh_hans_cn: 助理

# AssistantTemplate
source: Assistant reply template
zh_hans_cn: 助理回复模板

# AssistantTemplateDescription
source: Indicates the tag for assistant/robot/model replies, default is Assistant: {{assistant}}
zh_hans_cn: 表示助理/机器人/模型回复的标记，默认为 Assistant: {{assistant}}

source: Audio count
zh_hans_cn: 音频数

source: Audio history
zh_hans_cn: 音频历史

# AudioInputPlaceholder
source: Please enter the text to be converted to speech
zh_hans_cn: 请输入需要转换成语音的文本

# AudioServices
source: Speech services
zh_hans_cn: 语音服务

# AutoDetected
source: Auto select
zh_hans_cn: 自动选择

# AvailableService
source: Available services
zh_hans_cn: 可用服务

source: Avatar
zh_hans_cn: 头像

# AvatarDropTip
source: Drag and drop here to set the avatar
zh_hans_cn: 拖放到此以设置头像

# AzureApiVersionDescription
source: Select the appropriate Azure Open AI API version
zh_hans_cn: 选择合适的 Azure Open AI 的 API 版本

# AzureOpenAIAccessKeyDescription
source: Find this value in the "Keys and Endpoints" of the corresponding resource in the Azure portal, available as KEY1 or KEY2
zh_hans_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值，可用 KEY1 或 KEY2

# AzureOpenAIEndpointDescription
source: Find this value in the "Keys and Endpoints" of the corresponding resource in the Azure portal
zh_hans_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值

# AzureRegionDescription
source: Find this value in the "Keys and Endpoints" of the corresponding resource in the Azure portal
zh_hans_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值

source: Azure Speech
zh_hans_cn: Azure 语音

# AzureTranslate
source: Azure / Bing Translate
zh_hans_cn: Azure / 必应翻译

source: Baidu Translate
zh_hans_cn: 百度翻译

# CallingToolTemplate
source: Calling: {0}
zh_hans_cn: 正在调用：{0}

source: Cancel
zh_hans_cn: 取消

# CancelDeletePlugin
source: Keep plugin
zh_hans_cn: 保留插件

# CanNotLoadAgentWarning
source: Unable to load the assistant. The corresponding service may have been deregistered. Please check and try again.
zh_hans_cn: 无法加载助理，其对应的服务可能已经注销，请检查后再试。

# CanNotLoadLocalModelWarning
source: Unable to load the local model. The model may have been deleted or the default preset is missing. Please try deleting and re-importing the model.
zh_hans_cn: 无法加载该本地模型，可能是模型已经被删除或者缺少默认预设，请尝试删除该模型后重新导入。

# CanNotLoadSessionPresetWarning
source: Unable to load the session preset. The corresponding service may have been deregistered. Please check and try again.
zh_hans_cn: 无法加载会话预设，可能是对应的服务已经注销，请检查后再试

source: Change directory
zh_hans_cn: 更改目录

# ChatInputPlaceholder
source: Please enter chat content...
zh_hans_cn: 请输入聊天内容...

# ChatModelsSettings
source: Chat model settings
zh_hans_cn: 对话模型设置

source: Chat services
zh_hans_cn: 对话服务

# ChatService_Full
source: Chat Services
zh_hans_cn: 聊天与对话服务

# ChatService_Slim
source: Chat
zh_hans_cn: 聊天

# ChatTurn
source: Conversation turn
zh_hans_cn: 对话轮次

# ChooseServiceOrAgent
source: Choose a service or assistant
zh_hans_cn: 选择一个服务或助理吧

# ChooseServiceOrAgentDescription
source: Start a constructive conversation!
zh_hans_cn: 开启一场建设性会谈！

# CleanChatMessagesWarning
source: Do you want to clear the current chat history?
zh_hans_cn: 是否要清空当前的聊天记录？

# CleanMessages
source: Clear messages
zh_hans_cn: 清空消息

source: Click to rename
zh_hans_cn: 点击以重命名

source: Close
zh_hans_cn: 关闭

source: Close directory
zh_hans_cn: 关闭目录

source: Confirm
zh_hans_cn: 确认

# ContextLength
source: Context window length
zh_hans_cn: 上下文窗口长度

# ContextLengthDescription
source: Refers to the maximum length of content the model can accept in a single session. Both user input and model output are counted within the entire context window.
zh_hans_cn: 指在一次会话中，模型能接受的内容最大长度。用户输入与模型输出都算在整个上下文窗口内

# ContextLength_128K
source: 131072 tokens
zh_hans_cn: 131072 个令牌（Token），约合 6 万个汉字

# ContextLength_12K
source: 12288 tokens
zh_hans_cn: 12288 个令牌（Token），约合 6 千个汉字

# ContextLength_16K
source: 16385 tokens
zh_hans_cn: 16385 个令牌（Token），约合 8 千个汉字

# ContextLength_256K
source: 262144 tokens
zh_hans_cn: 262144 个令牌（Token）, 约合 13 万个汉字

# ContextLength_2K
source: 2048 tokens
zh_hans_cn: 2048 个令牌（Token），约合 1 千个汉字

# ContextLength_32K
source: 32768 tokens
zh_hans_cn: 32768 个令牌（Token），约合 1 万 6 千个汉字

# ContextLength_4K
source: 4096 tokens
zh_hans_cn: 4096 个令牌（Token），约合 2 千个汉字

# ContextLength_8K
source: 8124 tokens
zh_hans_cn: 8124 个令牌（Token），约合 4 千个汉字

# ContextLength_Unknown
source: Unknown context window length. The application will not provide an over-limit warning until the service returns an error.
zh_hans_cn: 未知的上下文窗口长度，应用不会给出超限提醒，直到服务返回错误

source: Copied
zh_hans_cn: 已复制

source: Copy
zh_hans_cn: 复制

source: Copy image
zh_hans_cn: 复制图像

# CopyrightTemplate
source: {0} Richasy. All rights reserved.
zh_hans_cn: {0} Richasy。保留所有权利。

source: Copy source text
zh_hans_cn: 复制源文本

source: Copy translated text
zh_hans_cn: 复制翻译文本

source: Create
zh_hans_cn: 创建

source: Create custom model
zh_hans_cn: 创建自定义模型

# CreateNewSize
source: Add a new size
zh_hans_cn: 添加一个新的尺寸吧

source: Custom model
zh_hans_cn: 自定义模型

source: Dark theme
zh_hans_cn: 深色

source: Dash Scope
zh_hans_cn: 阿里灵积

source: Delete
zh_hans_cn: 删除

# DisableSearch
source: Disable real-time search
zh_hans_cn: 禁用实时搜索功能

# DrawCount
source: Number of drawings
zh_hans_cn: 绘图张数

# DrawFailed
source: Image generation failed, please try again later
zh_hans_cn: 图像生成失败，请稍后再试

# DrawHistory
source: Drawing history
zh_hans_cn: 绘图历史

# DrawInputPlaceholder
source: Please enter drawing prompts
zh_hans_cn: 请输入绘图提示词

# DrawServices
source: Drawing services
zh_hans_cn: 绘图服务

# DrawSize
source: Drawing size
zh_hans_cn: 绘图尺寸

# DrawSizeCanNotBeEmpty
source: Alternative drawing size must be set
zh_hans_cn: 必须要设置备选的绘图尺寸

# DropPresetImageTip
source: Click the image area or drag the image into the box to create a preset image
zh_hans_cn: 点击图片区域或者将图片拖拽到框内，以此创建预设图片

source: Enable citation
zh_hans_cn: 上角标返回

# EnableCitationDescription
source: When enabled, there is a chance to trigger search trace information
zh_hans_cn: 开启后，有概率触发搜索溯源信息

source: Enable trace
zh_hans_cn: 搜索溯源信息

# EnableTraceDescription
source: If enabled, search trace information will be returned in enhanced search scenarios
zh_hans_cn: 如果开启，在触发了搜索增强的场景下，会返回搜索溯源信息

# Endpoint
source: Endpoint (API)
zh_hans_cn: 终结点（API）

# EndpointDescription
source: Must include http(s)://
zh_hans_cn: 必须包含 http(s)://

# EndpointPlaceholder
source: e.g., https://api.openai.com/v1
zh_hans_cn: 如 https://api.openai.com/v1

# EndTemplate
source: End of conversation content
zh_hans_cn: 对话结尾内容

# EndTemplateDescription
source: Indicates the content appended when the chat history is converted to context and sent to the model, default is Assistant:
zh_hans_cn: 表示当聊天记录被转换成上下文发送给模型时追加的内容，默认为 Assistant:

# ExceedTextLimit
source: Exceed text length limit
zh_hans_cn: 超出文本长度限制

source: Exit
zh_hans_cn: 退出

# ExitAppDescription
source: You can also choose to hide the app and quickly switch back when needed. You can exit the app anytime from the system tray.
zh_hans_cn: 你也可以选择隐藏应用，并在需要时快速切回来。你可以随时在系统托盘中退出应用

# ExitAppTitle
source: Exit app?
zh_hans_cn: 退出应用？

# FilterCharactersDescription
source: The large model may produce some unexpected characters. You can add them here, and the app will remove these characters before displaying the content.
zh_hans_cn: 大模型可能会产出一些意外的字符，你可以在这里添加它们，应用会在展示内容前移除这些字符

source: Filter characters (optional)
zh_hans_cn: 过滤字符（可选）

source: Finish
zh_hans_cn: 完成

# FinishDescription
source: Rodel Agent will provide AI services based on your configuration. You can modify your configuration in the settings at any time. Enjoy your experience!
zh_hans_cn: 小幻助理将基于您的配置为您提供 AI 服务，您随时可以在设置中修改你的配置，祝您使用愉快！

# FinishTitle
source: You have completed all configurations!
zh_hans_cn: 您完成了所有配置！

source: Frequency penalty
zh_hans_cn: 语句重复惩罚

# FrequencyPenaltyDescription
source: The higher the value, the less likely the model will repeat the same sentence verbatim.
zh_hans_cn: 值越大，模型逐字重复相同语句的可能性越低

# FunctionCount
source: Number of methods included
zh_hans_cn: 包含的方法个数

# FunctionList
source: Method list
zh_hans_cn: 方法列表

# GenerateCancelled
source: You have canceled content generation
zh_hans_cn: 你取消了内容生成

# GenerateTitleFailed
source: Failed to generate title
zh_hans_cn: 尝试生成标题时失败

source: Generating...
zh_hans_cn: 生成中...

source: Generic
zh_hans_cn: 通用

source: Generic settings
zh_hans_cn: 通用设置

source: Google Translate
zh_hans_cn: 谷歌翻译

source: Height
zh_hans_cn: 高度

source: Hide
zh_hans_cn: 隐藏

source: History
zh_hans_cn: 历史记录

# HunYuan
source: Tencent HunYuan
zh_hans_cn: 腾讯混元

# HunYuanSecretDescription
source: Obtain the key from "API Key Management" in the Tencent Cloud Console
zh_hans_cn: 从腾讯云控制台的 "API密钥管理" 中获取密钥

# ImageGenerate_Full
source: Image Generation
zh_hans_cn: 图像生成

# ImageGenerate_Slim
source: Image
zh_hans_cn: 图像

source: Image not found
zh_hans_cn: 图片不存在

source: Import local model
zh_hans_cn: 导入本地模型

source: Import plugin
zh_hans_cn: 导入插件

source: Insert image
zh_hans_cn: 插入图片

source: Join QQ group
zh_hans_cn: 加入 QQ 群

source: Just add message
zh_hans_cn: 仅添加消息

# JustAddMessageDescription
source: Only add the current content to the message list without requiring a model response
zh_hans_cn: 只将当前内容添加到消息列表，不要求模型回应

source: Key ID
zh_hans_cn: 密钥 ID

source: Language
zh_hans_cn: 语言

source: Launch app
zh_hans_cn: 启动应用

# LightTheme
source: Light
zh_hans_cn: 浅色

# LingYi
source: 01.AI
zh_hans_cn: 零一万物

source: Local models
zh_hans_cn: 本地模型

source: Max output tokens
zh_hans_cn: 最大输出标记数

# MaxOutputTokensDescription
source: The maximum value for generating content, approximately 2 tokens correspond to 1 Chinese character
zh_hans_cn: 要生成内容的最大值，中文下大约2个标记对应1个汉字

source: Max tokens
zh_hans_cn: 最大标记数

# MaxTokensDescription
source: The maximum value for generating content, approximately 2 tokens correspond to 1 Chinese character
zh_hans_cn: 要生成内容的最大值，中文下大约2个标记对应1个汉字

# MaxTurnDescription
source: One question and one answer constitute one turn. The default is 0, meaning no limit on turns. You can manually adjust the limit, and the application will capture the specified number of turns in the current session as context to pass to the model
zh_hans_cn: 一问一答谓之一轮，默认为0，表示不限轮次。 你可以手动调整限值，应用将在当前会话中截取指定轮次作为上下文传递给模型

source: Model
zh_hans_cn: 模型

# ModelAlreadyExist
source: The model already exists, please do not create it again
zh_hans_cn: 模型已经存在，请勿重复创建

# ModelAlreadyImported
source: The model has already been imported
zh_hans_cn: 该模型已经导入

source: Model ID
zh_hans_cn: 模型 ID

# ModelIdDescription
source: Model ID is the true identifier of the model, and AI services use this identifier to determine the model
zh_hans_cn: 模型 ID 是该模型的真实标识名称，AI 服务通过此标识确定模型

# ModelIdPlaceholder
source: e.g., "gpt-3.5-turbo"
zh_hans_cn: 如 "gpt-3.5-turbo"

source: Model list
zh_hans_cn: 模型列表

source: Model name
zh_hans_cn: 模型名称

# ModelNameDescription
source: The model name is a readable name displayed on the interface within the application
zh_hans_cn: 模型名称是应用内部显示在界面上的可读名称

# ModelNameOrIdCanNotBeEmpty
source: Model ID or name cannot be empty
zh_hans_cn: 模型 ID 或名称不能为空

# ModelNamePlaceholder
source: e.g., "ChatGPT 3.5"
zh_hans_cn: 如 "ChatGPT 3.5"

# ModelNotSupportImage
source: This model does not support image messages
zh_hans_cn: 该模型并不支持图片消息

source: Modify
zh_hans_cn: 修改

# ModifyAgent
source: Modify assistant
zh_hans_cn: 修改助理

source: Modify custom model
zh_hans_cn: 修改自定义模型

source: Modify default preset
zh_hans_cn: 修改默认预设

source: Modify model
zh_hans_cn: 修改模型

source: Modify preset
zh_hans_cn: 修改预设

source: Moonshot
zh_hans_cn: 月之暗面

source: More options
zh_hans_cn: 更多选项

source: My Chat
zh_hans_cn: 我的对话

# NeedDrawImage
source: Start drawing!
zh_hans_cn: 开始画图吧！

# NeedDrawImageDescription
source: Describe what you want, and let the AI handle the rest
zh_hans_cn: 描述你想要的内容，剩下的交给 AI

# NeedGenerateSpeech
source: Convert to speech
zh_hans_cn: 转成语音

# NeedGenerateSpeechDescription
source: Enter text and let the AI speak
zh_hans_cn: 输入内容，让 AI 开口说话

source: Negative prompt
zh_hans_cn: 负面提示词

source: Never ask me again
zh_hans_cn: 不再询问我

source: New agent
zh_hans_cn: 新的助理

source: New session
zh_hans_cn: 新会话

source: Next step
zh_hans_cn: 下一步

# NoAgents
source: No available assistants
zh_hans_cn: 没有可用的助理

# NoAudioHistory
source: No audio records yet, go generate one~
zh_hans_cn: 还没有音频记录，快去生成一个吧~

# NoAvailableService
source: No available services
zh_hans_cn: 没有可用的服务

# NoAvailableServiceDescription
source: Please add the corresponding services in the settings page
zh_hans_cn: 请在设置页面中添加对应的服务

# NoDrawHistory
source: No drawing records yet, go draw one~
zh_hans_cn: 还没有绘图记录呢，快去画一张吧~

# NoLocalModels
source: No local models available
zh_hans_cn: 暂无本地模型

# NoMessage
source: Start a conversation!
zh_hans_cn: 开始对话吧！

# NoMessageDescription
source: Enter text in the box below to send a message!
zh_hans_cn: 在下方的文本框中输入内容发送消息吧！

# NoPlugins
source: No plugins available
zh_hans_cn: 暂无插件

# NoPluginsDescription
source: You can import new plugins from the top menu
zh_hans_cn: 你可以在顶部菜单中导入新的插件

# NoSessionHistory
source: Start a new conversation!
zh_hans_cn: 开启新的对话吧！

source: No translation history
zh_hans_cn: 没有翻译历史记录

source: Online audio services
zh_hans_cn: 在线音频服务

# OnlineAudioServicesDescription
source: Select the applicable audio service for configuration, then click Next
zh_hans_cn: 选择适用的音频服务进行配置，然后点击下一步

source: Online chat services
zh_hans_cn: 在线对话服务

# OnlineChatServicesDescription
source: Select the applicable chat service for configuration, then click Next
zh_hans_cn: 选择适用的对话服务进行配置，然后点击下一步

# OnlineDrawServices
source: Online drawing services
zh_hans_cn: 在线绘图服务

# OnlineDrawServicesDescription
source: Select the applicable drawing service for configuration, then click Next
zh_hans_cn: 选择适用的绘图服务进行配置，然后点击下一步

# OnlineTranslateServices
source: Online translation services
zh_hans_cn: 在线翻译服务

# OnlineTranslateServicesDescription
source: Select the applicable translation service for configuration, then click Next
zh_hans_cn: 选择适用的翻译服务进行配置，然后点击下一步

source: Open audio
zh_hans_cn: 打开音频

source: Open directory
zh_hans_cn: 打开目录

source: Open image
zh_hans_cn: 打开图片

source: Open log folder
zh_hans_cn: 打开日志文件夹

# OptionalPlaceholder
source: Leave blank if none
zh_hans_cn: 如果没有则不填

source: Organization (optional)
zh_hans_cn: 组织（可选）

# OtherProjects
source: Other projects by the developer
zh_hans_cn: 开发者的其他项目

# PenaltyScore
source: Repetition penalty
zh_hans_cn: 语句重复惩罚

# PenaltyScoreDescription
source: Reduce repetition by penalizing already generated tokens. The higher the value, the greater the penalty
zh_hans_cn: 通过对已生成的token增加惩罚，减少重复生成的现象，值越大，惩罚越大

# PluginDllNotFound
source: No matching DLL file found for the compressed package name
zh_hans_cn: 没有找到与压缩包名匹配的 DLL 文件

# PluginFolderNotFound
source: No corresponding plugin directory found
zh_hans_cn: 没有找到对应的插件目录

source: Plugin management
zh_hans_cn: 插件管理

# Plugins
source: Plugin list
zh_hans_cn: 插件列表

source: Predefined models
zh_hans_cn: 预定义模型

# PredefinedModelsDescription
source: View the built-in model list of {0}
zh_hans_cn: 查看 {0} 的内置模型列表

# PresencePenalty
source: Topic repetition penalty
zh_hans_cn: 话题重复惩罚

# PresencePenaltyDescription
source: The higher the value, the more likely the model will output new topics
zh_hans_cn: 值越大，模型输出新主题的可能性越高

source: Preset messages
zh_hans_cn: 预设消息

source: Preset name
zh_hans_cn: 预设名称

# PresetNamePlaceholder
source: An easy-to-remember name
zh_hans_cn: 一个好记的名字

# PressCtrlEnterSend
source: Press Ctrl + Enter to send
zh_hans_cn: 按 Ctrl + Enter 键发送

source: Press Enter to send
zh_hans_cn: 按 Enter 键发送

# PrevStep
source: Previous step
zh_hans_cn: 上一步

source: Project homepage
zh_hans_cn: 项目主页

# ProviderNotSupported
source: No implementation for the corresponding service provided, please switch services
zh_hans_cn: 没有提供对应服务的实现，请切换服务

# QianFan
source: Baidu QianFan
zh_hans_cn: 百度千帆

# QianFanSecretDescription
source: Obtain the Secret Key from "Application Access" on the Baidu QianFan large model platform
zh_hans_cn: 从百度千帆大模型平台的 "应用接入" 中获取 Secret Key

# QuitApp
source: Quit application
zh_hans_cn: 退出应用

# RAG_Full
source: Retrieval-Augmented Generation
zh_hans_cn: 检索增强生成

# RandomChat
source: Casual chat
zh_hans_cn: 随便聊聊

source: Read document
zh_hans_cn: 阅读文档

source: Regenerate
zh_hans_cn: 重新生成

source: Region
zh_hans_cn: 位置/区域

source: Remove all sessions
zh_hans_cn: 清除所有会话

source: Rename
zh_hans_cn: 重命名

# RenameSessionPlaceholder
source: Name this great conversation!
zh_hans_cn: 为这场伟大的对话命名吧！

source: Replace image
zh_hans_cn: 替换图像

source: Response format
zh_hans_cn: 响应格式

# ResponseFormatDescription
source: Indicates the format in which the model should return the response (special formats require model support)
zh_hans_cn: 指示模型需要以何种格式返回响应（特殊格式需要模型支持）

source: Restart
zh_hans_cn: 重启

# RestartAppToEffectTip
source: The operation will take effect after restarting the application
zh_hans_cn: 操作将在重启应用后生效

# RightClickDelete
source: Right-click to delete
zh_hans_cn: 右键单击以删除

source: Save as
zh_hans_cn: 另存为

source: Saved
zh_hans_cn: 已保存

# SavePreset
source: Save the current session as a preset
zh_hans_cn: 将当前会话保存为预设

source: Secret
zh_hans_cn: 密文（Secret）

source: Secret ID
zh_hans_cn: 密文 ID（Secret ID）

source: Secret Key
zh_hans_cn: 密文密钥（Secret Key）

source: See all models
zh_hans_cn: 查看全部模型

# Seed
source: Random seed
zh_hans_cn: 随机种子

# SeedDescription
source: The model will try to keep the same seed producing the same response content (requires model support)
zh_hans_cn: 模型会尽量保持相同的种子具有相同的相应内容（需要模型支持）

source: See document
zh_hans_cn: 查看文档

source: Select folder
zh_hans_cn: 选择文件夹

# SelectWorkDirectory
source: Select library folder
zh_hans_cn: 选择库文件夹

source: Send
zh_hans_cn: 发送

source: Send feedback
zh_hans_cn: 发送反馈

# ServiceAndAgent
source: Services & Agents
zh_hans_cn: 服务与助理

source: Services
zh_hans_cn: 服务

source: Session list
zh_hans_cn: 会话列表

source: Session options
zh_hans_cn: 会话选项

# SessionPreset
source: Session presets
zh_hans_cn: 会话预设

source: Settings
zh_hans_cn: 设置

source: Share
zh_hans_cn: 分享

source: Show information
zh_hans_cn: 查看说明

source: Smart rename
zh_hans_cn: 智能重命名

source: Source language
zh_hans_cn: 源语言

# SourceTextPlaceholder
source: Please enter the text to be translated
zh_hans_cn: 请输入要翻译的文本

# SparkDesk
source: iFlytek Spark
zh_hans_cn: 讯飞星火

# SparkDeskAppIdDescription
source: Register an application on the iFlytek Open Platform and obtain the APPID
zh_hans_cn: 在讯飞开放平台中注册应用并获取 APPID

# SparkDeskSecretDescription
source: Register an application on the iFlytek Open Platform and obtain the Secret
zh_hans_cn: 在讯飞开放平台中注册应用并获取 Secret

source: Speech input
zh_hans_cn: 语音输入

# StopSequencesDescription
source: Add specific characters to help the model stop generating content
zh_hans_cn: 添加特定的字符以辅助模型停止生成内容

source: Stop sequences (optional)
zh_hans_cn: 终止标记（可选）

source: Stream output
zh_hans_cn: 流式输出

# StreamOutputDescription
source: The model generates responses word by word (typewriter mode)
zh_hans_cn: 模型会逐字逐句生成响应（打字机模式）

source: Support file upload
zh_hans_cn: 支持文件上传

# SupportSizes
source: Supported sizes
zh_hans_cn: 支持的尺寸

# SupportTool
source: Support tool invocation
zh_hans_cn: 支持工具调用

source: Support vision
zh_hans_cn: 支持视觉

# SyncConfig
source: Sync configuration
zh_hans_cn: 同步配置

# SystemDefault
source: Use system settings
zh_hans_cn: 使用系统设置

# SystemInstruction
source: Instruction
zh_hans_cn: 系统指令

# SystemInstructionPlaceholder
source: Write dialogue background/character description/psychological expectations to guide the model's response
zh_hans_cn: 写入对话背景/角色描述/心理预期等引导模型回答的内容

# SystemTemplate
source: System instruction template
zh_hans_cn: 系统指令模板

# SystemTemplateDescription
source: Special tag representing system instructions, default is System: {{system}}
zh_hans_cn: 表示系统指令的特殊标记，默认为 System: {{system}}

source: Target language
zh_hans_cn: 目标语言

source: Target language cannot be empty
zh_hans_cn: 目标语言不能为空

# TargetTextPlaceholder
source: The translated text will be displayed here
zh_hans_cn: 翻译后的文本将显示在这里

# Temperature
source: Sampling temperature
zh_hans_cn: 采样温度

# TemperatureDescription
source: Higher values make the output more random, while lower values make the results more focused and deterministic (usually not mixed with nucleus sampling factor)
zh_hans_cn: 较高的值将使输出更随机，而较低的值将使结果更加集中和确定性（通常不与核采样因子混用）

# TencentAccessKeyDescription
source: Register on Tencent Cloud and obtain the access key
zh_hans_cn: 在腾讯云中注册并获取访问密钥

# TencentSecretIdDescription
source: Register on Tencent Cloud and obtain the Secret Id
zh_hans_cn: 在腾讯云中注册并获取 Secret Id

# TencentTranslate
source: Tencent Cloud Translate
zh_hans_cn: 腾讯云翻译

source: Tip
zh_hans_cn: 提醒

source: Tools
zh_hans_cn: 工具

# TopK
source: Number of candidates
zh_hans_cn: 候选数目

# TopKDescription
source: Randomly select one from a specified number of token candidates (non-uniform probability)
zh_hans_cn: 从指定数目的标记候选中随机选择⼀个（非等概率）

# TopP
source: Nucleus sampling factor
zh_hans_cn: 核采样因子

# TopPDescription
source: Only consider higher quality token results, for example, at 0.1, the model only considers tokens within the top 10% of probability mass (usually not mixed with sampling temperature)
zh_hans_cn: 只考虑较高质量的标记结果，例如 0.1 时，模型仅考虑包含概率质量前 10% 的标记（通常不与采样温度混用）

source: Translate
zh_hans_cn: 翻译

# TranslateRecord
source: Translation record
zh_hans_cn: 翻译记录

# TranslateRecordDescription
source: When turned off, the application will not record new machine translation history
zh_hans_cn: 关闭后，应用不会记录新的机器翻译历史

# TranslateServices
source: Translation Services
zh_hans_cn: 翻译服务

# TranslateService_Full
source: Translation Services
zh_hans_cn: 翻译服务

# TranslateService_Slim
source: Translate
zh_hans_cn: 翻译

# TranslationFailed
source: Translation failed, please try again later
zh_hans_cn: 翻译失败，请稍后再试

# TypePresetMessagePlaceholder
source: Please enter the preset message
zh_hans_cn: 请输入预设的信息

# Unknow
source: Unknown
zh_hans_cn: 未知

# UnknowError
source: An unknown error occurred, please try again later
zh_hans_cn: 发生了未知错误，请稍后重试

source: User
zh_hans_cn: 用户

# UserTemplate
source: User message template
zh_hans_cn: 用户消息模板

# UserTemplateDescription
source: Represents the message sent by the user, default is User: {{user}}
zh_hans_cn: 表示用户发送的消息的标记，默认为 User: {{user}}

# V1Migrating
source: Migrating old version data, please do not close the application, it will restart automatically shortly
zh_hans_cn: 正在迁移旧版本数据，请勿关闭应用，稍后会自动重启
